# ******************** ↓タスク↓ ********************
# ・コイン⇒ハート
# ・解説画面（ESCAPE）の作成
# ・使用画像、サウンドを変更
# ・設計書に落とし込む
# ・ソースコメント、変数整理
# 　・コイン⇒ポイント
# 　・maze⇒field
# 　・茶⇒橙
# ******************** ↑タスク↑ ********************

import sys
from python import main as M

# ============================================================
#                         MAIN呼び出し
# ============================================================
if __name__ == '__main__':
    lg = M.get_logger(__name__, 'log.txt')

    try:
        M.main()
    except:
	    lg.exception(sys.exc_info()) #エラーをlog.txtに書き込む
